glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
static void debug_packet_fn(s_expr_tree_instance_t* inst, const char* msg) {
    (void)inst;
    if (!msg) return;
    size_t len = strlen(msg);
    if (len > COMM_PAYLOAD_MAX) len = COMM_PAYLOAD_MAX;
    frame_meta_t meta = {
        .addr        = 1,
        .cmd         = OP_DBG_LOG,
        .seq         = g_dbg_seq++,
        .ack_seq     = 0,
        .ack_status  = 0,
        .payload_len = (uint8_t)len,
    };
    (void)frame_encode_s2m(&meta, (const uint8_t*)msg, &g_tx_ring);
}

// ----------------------------------------------------------------------------
// Tick the tree and drain its event queue. Mirrors the
// tick_with_event_queue() pattern from s_engine_builtins_spawn.h: each popped
// event is delivered as a fresh node_tick with that event_id, so chain
// dispatchers see the same event_id they would on Linux.
// ----------------------------------------------------------------------------

static void tick_and_drain(s_expr_tree_instance_t* tree) {
    (void)s_expr_node_tick(tree, SE_EVENT_TICK, NULL);
    while (s_expr_event_queue_count(tree) > 0) {
        uint16_t tick_type;
        uint16_t event_id;
        void* event_data;
        s_expr_event_pop(tree, &tick_type, &event_id, &event_data);
        uint16_t saved = tree->tick_type;
        tree->tick_type = tick_type;
        (void)s_expr_node_tick(tree, event_id, event_data);
        tree->tick_type = saved;
    }
}

// ----------------------------------------------------------------------------
// Drain inbound CDC bytes through the decoder. On FRAME_READY push the cmd to
// the tree's event queue; tick_and_drain on the next tick will dispatch it.
// payload pointer is *not* retained — the chain currently dispatches on
// event_id only, no PING payload. When that changes, copy bytes here.
// ----------------------------------------------------------------------------

static uint8_t g_rx_buf[64];
static uint8_t g_rx_payload[COMM_PAYLOAD_MAX];

static uint8_t g_poll_reply_seq = 0;

// OP_POLL is handled inline (not through the chain) so it works in any
// dongle state — useful for diagnostics during BOOT/L1_DONE. Reply is the
// 64 B il_status_buffer_t pre-built by interlock_tick_all().
static void handle_op_poll_inline(void) {
    const il_status_buffer_t* sb = interlock_get_status_buffer();
    frame_meta_t meta = {
        .addr        = 1,
        .cmd         = OP_POLL_REPLY,
        .seq         = g_poll_reply_seq++,
        .ack_seq     = 0,
        .ack_status  = 0,
        .payload_len = (uint8_t)IL_STATUS_BUFFER_SIZE,
    };
    (void)frame_encode_s2m(&meta, (const uint8_t*)sb, &g_tx_ring);
}

// ----------------------------------------------------------------------------
// Drain reassembled RS-485 frames and push each one to the host as
// OP_RS485_FRAME_RX [from_addr:u8][payload bytes]. Called every main-loop
// iteration alongside the CDC RX drain. Bounded per call (drain a few frames)
// so a flooded bus can't starve the rest of the loop; remaining frames are
// picked up next iteration.
// ----------------------------------------------------------------------------

static uint8_t g_rs485_rx_seq = 0;

static void rs485_drain_to_host(void) {
    uint8_t addr;
    uint8_t payload[RS485_PAYLOAD_MAX];
    uint8_t len;
    for (uint8_t guard = 0; guard < 4; guard++) {
        if (!rs485_poll_frame(&addr, payload, &len)) return;
        uint8_t frame[1 + RS485_PAYLOAD_MAX];
        frame[0] = addr;
        for (uint8_t i = 0; i < len; i++) frame[1 + i] = payload[i];
        frame_meta_t meta = {
            .addr        = 1,
            .cmd         = OP_RS485_FRAME_RX,
            .seq         = g_rs485_rx_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = (uint8_t)(1u + len),
        };
        (void)frame_encode_s2m(&meta, frame, &g_tx_ring);
    }
}

#if defined(ROLE_BUS_CONTROLLER)
// ----------------------------------------------------------------------------
// Bus-controller bridge (BC-1b). The bus_controller is its own libcomm node at
// BUS_CONTROLLER_LOCAL_ADDR; frames from the Pi carrying any OTHER addr are
// destined for that RS-485 slave. We forward the frame payload (an
// OP_SHELL_EXEC body) over the bus, then non-blockingly wait for the slave's
// reply and relay it back to the Pi as an OP_SHELL_REPLY tagged with the slave
// addr. One transaction in flight (matches libcomm's one-in-flight rule). The
// bounded deadline IS dead-slave detection — on timeout we NAK the Pi. RX
// stays in sniffer mode (rs485_init default my_addr=0xFF) so any slave's reply
// is accepted.
// ----------------------------------------------------------------------------
// The host (dongle_console) sends m2s frames with addr=0x00, so 0x00 = "for the
// bus_controller itself" (sync ladder, its own shell). Any other addr = route to
// that RS-485 slave. Slaves therefore must not use rs485_addr 0 (which is also
// the RS-485 broadcast address — consistent).
#define BUS_CONTROLLER_LOCAL_ADDR 0u
#define BRIDGE_TIMEOUT_MS         1500u   // covers slow HIL (adc_capture ~300ms); < WDT 4s

static bool     g_bridge_pending  = false;
static uint8_t  g_bridge_slave    = 0;
static uint32_t g_bridge_deadline = 0;
static uint8_t  g_bridge_seq      = 0;

// Called from rx_drain when a Pi frame addressed to a slave arrives.
static void bridge_start(uint8_t slave, const uint8_t* payload, uint8_t len) {
    if (g_bridge_pending) return;          // one-in-flight; drop (host will retry)
    rs485_send_frame(slave, payload, len);
    g_bridge_slave    = slave;
    g_bridge_deadline = board_millis() + BRIDGE_TIMEOUT_MS;
    g_bridge_pending  = true;
}

// Called every main-loop iteration. Relays the slave reply, or NAKs on timeout.
static void rs485_bridge_poll(void) {
    if (!g_bridge_pending) return;
    uint8_t from_addr;
    uint8_t reply[RS485_PAYLOAD_MAX];
    uint8_t reply_len;
    if (rs485_poll_frame(&from_addr, reply, &reply_len)) {
        frame_meta_t meta = {
            .addr        = g_bridge_slave,        // tells the Pi which slave answered
            .cmd         = OP_SHELL_REPLY,
            .seq         = g_bridge_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = reply_len,
        };
        (void)frame_encode_s2m(&meta, reply, &g_tx_ring);
        g_bridge_pending = false;
    } else if ((int32_t)(board_millis() - g_bridge_deadline) >= 0) {
        // Dead/slow slave — relay OP_NAK { reason, rejected_cmd } to the Pi.
        uint8_t nak[3] = {
            (uint8_t)NAK_ERR_NO_RESOURCES,
            (uint8_t)(OP_SHELL_EXEC & 0xFFu),
            (uint8_t)(OP_SHELL_EXEC >> 8),
        };
        frame_meta_t meta = {
            .addr        = g_bridge_slave,
            .cmd         = OP_NAK,
            .seq         = g_bridge_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = sizeof(nak),
        };
        (void)frame_encode_s2m(&meta, nak, &g_tx_ring);
        g_bridge_pending = false;
    }
}
#endif  // ROLE_BUS_CONTROLLER

