glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
#if defined(ROLE_SLAVE)
// ----------------------------------------------------------------------------
// RS-485 slave shell tunnel (BC-1a, synchronous). Frames are accepted only when
// addressed to our rs485_addr (set at boot via rs485_config). The payload of an
// inbound frame IS an OP_SHELL_EXEC body [request_id u16][command_id u16][args];
// we dispatch it through the SAME shell layer used over USB and send the
// OP_SHELL_REPLY body back over RS-485, sourced from our own address. This makes
// the full workbench/HIL command suite runnable on the slave node over the bus
// with no new command code. Synchronous + main-loop (USB is commissioning-only
// on a slave); the master waits for the reply. Replies > RS485_PAYLOAD_MAX are
// clamped by rs485_send_frame (fragmentation is a later BC slice).
// ----------------------------------------------------------------------------
#define RS485_SHELL_EXEC_HEADER_LEN 4u   // request_id u16 + command_id u16

static void rs485_slave_poll(void) {
    uint8_t addr;
    uint8_t payload[RS485_PAYLOAD_MAX];
    uint8_t len;
    for (uint8_t guard = 0; guard < 4; guard++) {
        if (!rs485_poll_frame(&addr, payload, &len)) return;
        if (len < RS485_SHELL_EXEC_HEADER_LEN) continue;  // too short to dispatch
        uint8_t reply[COMM_PAYLOAD_MAX];
        uint16_t reply_len = shell_dispatch_payload(payload, len, reply);
        rs485_send_frame(register_dongle_rs485_addr(), reply, (uint8_t)reply_len);
    }
}
#endif

static void rx_drain_to_event_queue(s_expr_tree_instance_t* tree) {
    if (!tud_cdc_connected() || !tud_cdc_available()) return;
    uint32_t n = tud_cdc_read(g_rx_buf, sizeof(g_rx_buf));
    for (uint32_t i = 0; i < n; i++) {
        frame_meta_t meta;
        frame_decode_result_t r =
            frame_decoder_feed(&g_rx_decoder, g_rx_buf[i], &meta, g_rx_payload);
        if (r == FRAME_DECODE_FRAME_READY) {
            // Slice 6 — feed the IL_VIRT_T_SINCE_M2S virtual.
            g_last_m2s_rx_ms = board_millis();
#if defined(ROLE_BUS_CONTROLLER)
            // Address routing: a frame for any addr other than ours is destined
            // for an RS-485 slave — bridge it instead of dispatching locally.
            if (meta.addr != BUS_CONTROLLER_LOCAL_ADDR) {
                bridge_start(meta.addr, g_rx_payload, meta.payload_len);
                continue;
            }
#endif
            // OP_COMMISSION_SET carries a u32 new_instance_id. Stage it into
            // a single-producer/single-consumer global so the chain handler
            // can read it; libcomm's one-in-flight rule keeps this race-free.
            if (meta.cmd == OP_COMMISSION_SET && meta.payload_len >= 4) {
                g_pending_commission_instance_id =
                    (uint32_t)g_rx_payload[0] |
                    ((uint32_t)g_rx_payload[1] <<  8) |
                    ((uint32_t)g_rx_payload[2] << 16) |
                    ((uint32_t)g_rx_payload[3] << 24);
            }
            // OP_POLL: inline-handled (skips chain); replies with status buffer.
            if (meta.cmd == OP_POLL) {
                handle_op_poll_inline();
                continue;
            }
            // OP_SHELL_EXEC carries a variable-length binary message that
            // outlives a single rx_drain pass. Queue it; only push the engine
            // event if the queue accepted it, otherwise the handler would
            // replay an older payload (was the request_id-cluster bug).
            if (meta.cmd == OP_SHELL_EXEC) {
                if (meta.payload_len <= COMM_PAYLOAD_MAX
                    && shell_pending_push(g_rx_payload, meta.payload_len)) {
                    s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
                }
                // else: queue full or oversize — drop. Host's request times out.
            } else {
                // All non-shell opcodes: just push (event_data NULL).
                s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
            }
        }
        // BAD_CRC / BAD_LEN / OVERFLOW: decoder auto-resets; nothing to do
        // here — a host-side retry will re-sync on the next leading END.
    }
}

// ----------------------------------------------------------------------------
// Entry
// ----------------------------------------------------------------------------

int main(void) {
    // Snapshot PM->RCAUSE BEFORE anything else can clobber it. Distinguishes
    // WDT bite (the layer-2 chain-stuck signal) from power-on / external
    // reset / NVIC_SystemReset.
    hal_capture_reset_cause();

    // Paint stack + install canary. Must run AFTER reset cause capture
    // (which uses minimal stack) and BEFORE any deeper call chain that
    // would consume more stack than our 64 B paint-safety margin allows.
    stack_paint_and_canary();

    // Interlock framework boot decision. Reads .noinit persistence, applies
    // bootloop guard, marks slots POISONED if they've crashed too many times
    // in a row. Must run before board_init / engine setup so the framework
    // can also report attribution if the very next thing crashes.
    interlock_boot_decide();

    board_init();

    // Arm the WDT immediately after board_init so any subsequent hang in
    // tusb_init / engine bring-up triggers recovery within ~4 s. The pet
    // site lives in the s_engine chain pump (s_expr_node_tick).
    hal_wdt_init();

    // Bring up always-on peripherals (DAC, ADC, and future I2C/RS-485) once,
    // pre-engine. Pins they own are reserved from GPIO commands by
    // pin_is_reserved() in samd21_commands.c.
    samd21_peripherals_init();

    // Re-parse + re-claim pins for any DSL-defined interlock slots that
    // survived the warm boot. Slots that fail re-parse / re-claim are
    // marked POISONED. Idempotent on cold boot (no ARMED slots).
    interlock_warm_restore();

    tusb_rhport_init_t const rhport_init = {
        .role  = TUSB_ROLE_DEVICE,
        .speed = TUSB_SPEED_AUTO,
    };
    tusb_init(BOARD_TUD_RHPORT, &rhport_init);

